//ADVJOB   JOB (ACCT),'ADVANCED',CLASS=A
//         SET PROGRAM=ADVPROG
//STEP01   EXEC PROC=RUNPROC,PROGRAM=ADVPROG
//RUNPROC  PROC PROGRAM=IEFBR14
//RUN      EXEC PGM=&PROGRAM
//PEND
