//INNERPROC PROC PGM=INNERPGM,INDSN=APP.DEFAULT.INPUT
//RUN      EXEC PGM=&PGM
//INFILE   DD DSN=&INDSN,DISP=SHR
//OUTFILE  DD DSN=APP.&PGM..OUTPUT,DISP=(NEW,CATLG)
