       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADVPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY BASE-REC REPLACING ==:PREFIX:== BY ==ADV==.
       PROCEDURE DIVISION.
       MAIN-PARA.
           CALL 'MQPUT' USING HCONN HOBJ 'ADV.EVENT.QUEUE'.
           CALL WS-NEXT-PROGRAM.
           GOBACK.
